app/controllers/faves_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."favorite" = $1  [["favorite", true]]
---
    def faves
        favorites = Song.where(favorite: true)