app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Goodbye Yellow Brick Road"], ["artist", "Elton John"], ["time", "4:00"], ["created_at", "2020-08-06 17:26:01.570564"], ["updated_at", "2020-08-06 17:26:01.570564"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "favorite" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["favorite", true], ["updated_at", "2020-08-06 20:27:53.751758"], ["id", 1]]
---
  def update
    if @song.update(song_params)